# General messages related to terms of use consent.

idp.terms-of-use.accept     = Eu aceito os termos de uso
idp.terms-of-use.submit     = Enviar
idp.terms-of-use.reject     = Recusar
idp.terms-of-use.required   = Marque este checkbox se voc&ê deseja proseguir.

# Triples consisting of a TOU key, and a title and text for each set of terms.
# The default implementation uses the SP name as the key, but this can be overriden.

https\://sp.example.org = example-tou-1
example-tou-1.title = Example Terms of Use
example-tou-1.text      = <em>*** This is an example ToU - tailor due to your needs ***</em> \
                        <p>Example organization AAI services: Terms of Use (ToU)</p> \
                        <strong>A. Data Protection Sample Clause</strong> \
                        <p> \
                        "The End User notes that personal data about the End User is compiled from generally \
                        available sources and from communications received from the End User and other \
                        Universities as well as from off-site sources. The policy relating to the use and procession \
                        of such data is posted on the University website at [...]. Such data will be used, inter alia, \
                        to authenticate and authorize the access to and use of various resources within \
                        the University and on other sites ("Approved Uses"). The End User hereby consents to \
                        the collection, processing, use and release of such data to the extent reasonably necessary \
                        for the Approved Uses. Such consent includes, but is not limited to, the release \
                        of personal data to other institutions by employing cookies and electronically exchanging, \
                        caching and storing personal authorization attributes." \
                        </p> \
                        <strong>B. Limitation of Liability</strong> \
                        <p> \
                        "To the extent permitted by the applicable law, the End User hereby waives all and any \
                        claims for cost and damages, whether direct or indirect, incidental, or consequential(including, \
                        inter alia, loss of use and lost profits), both in contract and in tort, arising from \
                        the use or in any way related to the inter-organizational authentication and authorization \
                        services which allow the End User to access certain resources of other organizations. \
                        This waiver of claims shall be valid and effective in relation to all participants of \
                        the inter-organizational authentication and authorization services including the AAI \
                        Service Provider and its affiliates, officers, employees and agents." \
                        </p>

# Messages related to attribute release consent.

idp.attribute-release.revoke                       = Remover permiss&otilde;es de acesso a informa&ccedil;&atilde;o fornecidas para este servi&ccedil;o.

idp.attribute-release.title                        = Libera&ccedil;&atilde;o de Informa&ccedil;&otilde;es

idp.attribute-release.attributesHeader             = Informa&ccedil;&otilde;es a serem liberadas para este serv&ccedil;oo

idp.attribute-release.serviceNameLabel             = Você ir&aacute; liberar os seguintes acessos:
idp.attribute-release.of                           = de
idp.attribute-release.serviceDescriptionLabel      = Descri&ccedil;&atilde;o fornecida pelo servi&ccedil;o:

idp.attribute-release.informationURLLabel          = Informa&ccedil;&otilde;es adicionais sobre o servi&ccedil;o
idp.attribute-release.privacyStatementURLLabel     = Informa&ccedil;&otilde;es sobre privacidade

idp.attribute-release.showDetails                  = exibir detalhes

idp.attribute-release.accept                       = Aceitar
idp.attribute-release.reject                       = Rejeitar

idp.attribute-release.confirmationQuestion         = As informa&ccedil;&otilde;es acima ser&atilde;o compartilhadas com o servi&ccedil;o se vocëcirc; prosseguir. \
                                                     Voc&ecirc; aceita liberar esta informa&ccedil;&atilde;o para este servi&ccedil;o toda vez que voc&ecirc; acess&aacute;-lo?

idp.attribute-release.consentMethod                = Selecione a dura&ccedil;&atilde;o da libera&ccedil;&atilde;o de informa&ccedil;&otilde;es:
idp.attribute-release.consentMethodRevoke          = Esta configura&ccedil;&atilde;o pode ser cancelada a qualquer momento utilizando o checkbox na p&aacute;gina de login.

idp.attribute-release.doNotRememberConsent         = Pergunte-me novamente no pr&oacute;ximo login
idp.attribute-release.doNotRememberConsentItem     = Eu aceito enviar minhas informa&ccedil;&otilde;es apenas neste momento.

idp.attribute-release.rememberConsent              = Pergunte-me novamente caso hajam altera&ccedil;&otilde;es
idp.attribute-release.rememberConsentItem          = Eu aceito que estas informa&ccedil;&otilde;es ser&atilde;o enviadas automaticamente para este servi&ccedil;o no futuro.

idp.attribute-release.globalConsent                = N&atilde;o me pergunte novamente
idp.attribute-release.globalConsentItem            = Eu aceito que <strong>TODAS</strong> as minhas informa&ccedil;&otilde;es ser&atilde;o liberadas para <strong>QUALQUER</strong> servi&ccedil;o.

